import numpy as np

a = [i for i in range(9)]
a = np.array(a).reshape(3, 3)
print(a)
''' [[0 1 2]
     [3 4 5]
     [6 7 8]] '''

b = np.array(range(30))
print(b)
''' [ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29]'''

c = b.reshape(3, 2, 5)
print(c)
''' [[[ 0  1  2  3  4]
      [ 5  6  7  8  9]]

     [[10 11 12 13 14]
      [15 16 17 18 19]]

     [[20 21 22 23 24]
      [25 26 27 28 29]]] '''

c = np.array(range(20))
print(c.reshape(-1, 5))
''' [[ 0  1  2  3  4]
     [ 5  6  7  8  9]
     [10 11 12 13 14]
     [15 16 17 18 19]] '''
print(c.reshape(5, -1))
''' [[ 0  1  2  3]
     [ 4  5  6  7]
     [ 8  9 10 11]
     [12 13 14 15]
     [16 17 18 19]] '''
# -1을 이용하면 알맞는 값으로 자동으로 들어가짐
